[
    {
        "user": "UC2A2ARPT",
        "type": "message",
        "ts": "1682828183.924529",
        "edited": {
            "user": "UC2A2ARPT",
            "ts": "1682870706.000000"
        },
        "client_msg_id": "810e1a65-76bc-4ce8-bd49-5e655b2be9ae",
        "text": "That was a genuine and helpful comment, loaded with so many references I don’t know where to begin. There’s a lot about respect now swirling around in this soup, so I want to start by saying I deeply respect the effort and care you put into writing these replies, and I hope that you find the below helpful, at least to bring a modicum of direct clarity that my last (audio) reply to you lacked.\n\nI hold a spider web of beliefs, feelings, and perspectives on what makes for a compelling podcast. For instance, the medium is particularly well suited to playing with immediacy and distance. I’ve listened to some podcasters hours each week for well over a decade now. After listening to someone so much for so long, you begin to feel a kinship with them. You may hear their voice, thoughts, and opinions more than those of your friends and even some of your family. Most people listen with headphones, often while driving or running or doing chores or laying in bed — spaces of domestic intimacy. These people — these podcasters — are invited into your home and your life in a way that’s arguably more personal than the painting that hangs on your wall, the movie or game that plays on your TV, the book that sits on your bookshelf. When John Siracusa dies, I’ll mourn him the way I’ve mourned my friends who have passed. I’ll feel an emptiness in my daily life, at least for a while. To me, that’s profound.\n\nI say all this to establish that immediacy is an effectful trait of the medium. It’s worth similarly exploring how podcasts push at the other extreme, being strangely distant and impersonal (for instance, considering what John Siracusa feels about me — unknowing nothingness, or vague appreciation as one appreciates a drop in an ocean). It’s worth exploring so many other dimensions and aspects. But for now I just want to make a point about my relationship to immediacy as a person who operates in this medium: on principle, I try very, very hard not to directly explain how or why I make certain creative decisions, unless doing so furthers my artistic goals. I don’t intend to be obscure about everything, but when it comes to particular things — like what my creative intentions are — I prefer to keep them behind the curtain.\n\nNow, you’ve written a few beautiful comments that have meant a lot to me. You are bothered by this matter of disrespecting the greats of our field, and you’ve articulated this bother quite compellingly: “could cause your listeners to discount the importance of the papers or their authors”. This speaks to me. So I’m going to justify as best I can, with no playful ruse or manipulation of distance or surrealist feint, why I think that it’s a fine thing that I, ahem, talk shit about the great masters.\n\nTo start, know that I’m always just trying to make the sort of podcast I’d want to listen to, and that I'm just beginning to learn what is even possible within the medium, and that I'm failing as much as I succeed. I’m borrowing from all my influences, and mixing in ideas from other media, and trying to shape the result into something that reflects my tastes and embodies the ideas I want to express to the world. I love how Radiolab fuses sound design, music, and conversation into a sort of audio theatre. I love how Merlin Mann, across his thousand shows, creates this swirling mass of in-jokes and references and allusions and hallucinations that point back to his earlier in-jokes and references and allusions and hallucinations, a chaotic “I can’t explain why this is making me laugh and weep because it came from 15 years of living with this wacky character, but I’m overpowered and it feels transcendental”. I love how scores, arguably starting with Ligeti and all but inescapably today, are distilled noise music for the masses. I feel an almost parental love when I see someone struggling to do something, and they aren’t quite succeeding, and the thing they’re making is frankly bad, but you can tell what they’re going for and, with the benefit of the doubt, you can appreciate it just as much as if they had pulled it off. I love listening to friends debate, where the arguments swing between the matter at hand and personal jabs, taken with a smile and returned in kind because these are people who love and trust each other so deeply that they know how to tickle with their words. I love how the hosts of Connected create a segment, and then someone messes up and perverts the segment, and before long you have people lying down to read the rules of the inner game show within the segment where you stand up to read the rules of the outer game show, it’s convoluted meta-text all the way down, but somebody MUST be the loser, and they go last.\n\nI’m trying to bring a little bit of all of this, and put it into a podcast where we talk about computers. I’m not going to be content to merely have a podcast where we talk about computers. The subject is computers, but the form needs to be something very purposefully more than just “we talk about computers”.\n\nThere are so, so many podcasts about computers. On those podcasts, you can hear breathless hyperbole about the latest startup or framework. You can hear interview after interview following an identical formula — leading 15 second excerpt, electronic theme song with canned intro, quick banter between hosts, introduction of guest, guest’s background, warmup questions, questions about main topic, zoom-out question that’s usually the highlight of the show, hosts talking about things they like, pleading for Patreons, sign-off with social handles. You can hear someone reading a script they wrote after wiki-diving on some comp-sci esoterica. You can hear (usually) three (usually) white (usually) men talk about the latest Apple rumours. You get the picture. In each of these, people are speaking sincerely and directly. They're being their authentic selves. There's no line drawn between who they are on the show, and who they are in real life. They’re making audio diaries, or patterning themselves after journalists, presenting subject matter with little regard to the artistic form and medium that they’re operating within. They’re careful to be respectful of the material, because they're real people who are just as kind and enthusiastic in real life as they are on their show.\n\nI’m trying to make a show where the format is that there is no format (credit where due: this is a Merlin Mann-ism); where there’s a fruit salad of heated debate between people who aren’t even sure they’re debating the same thing, emphatic teary-eyed gushing of joy at the profundity of some shared revelation, and among many other similar things, merciless cheap-shot dunking on, yes, the revered grand pantheon works of great masters, because all of these things are a kind of iterated _character development_ that you don’t see in any of the shows described by the previous paragraph; meta-commentary and audio theatre and honest-to-goodness _songs_ and stingers and sonic bits that give each and every episode a distinct flavour; where you can’t tell if we’re being real or fake, awake or dreaming, scripted or improvising or being our authentic selves, smart or inane, funny or fearsome. I don't want the show to be a straightforward discussion, nor do I want it to be a scripted narrative. I want it to be a space where interesting ideas are shared in interesting ways.\n\n[Note to returning readers: the following paragraph was rewritten to better support the point I'm driving at.]\n\nSo to look back at your initial message:\n&gt; In general, it is more helpful to ask \"what was it about this person's experience and environment that led them to view things this way? Are those things relevant to me and to now? If so, how? If not, what is different?\" than to say \"F--- this paragraph\" or \"He's wrong here.\"\nIf my intention for the show was to be my pure authentic self, sharing my immediate perspectives on programming papers, your feedback here would be spot on, and I'd have no hesitation to agree. But my reply — inviting you to ask a similar sort of \"Why are they doing what they're doing?\" — was meant to suggest that I have other intentions for the show that sit at odds with your ask. One of which is that the Ivan who appears on the podcast is a _<https:\/\/www.youtube.com\/watch?v=YQQwrlGCID8|character>_. This character is _played up_ for effect, because, again, that's the sort of podcast I like to listen to. Yes, I like listening to shows where people are occasionally crass and disrespectful — especially when they’re doing it in honor or service of something higher than themselves, or winkingly, or as an interplay between high-brow and low-brow, or in an “afflict the comfortable \/ comfort the afflicted” punching-up sort of way, or simply because it creates more hilarity and drama. For this show, I want my character to wander around the entire space of positive and negative feelings engendered by every subject we touch upon. To me, that’s the most interesting and rewarding show I can create. It's what pushes the show away from being mere pabulum, and entices people to engage with the subject matter because they're bewitched and enthralled by how we present it.\n\nSo to conclude, I’ll just borrow a tired but true adage when frustrated with art. I’m making this podcast, and while I value the audience we have (so, so much — but that’s a tangent), I’m always going to make the sort of show that I want to listen to, and I don’t for a single moment expect that anyone else will enjoy it, nor do I aim to make it to please them. I’m quite confident that, for instance, Steve Krouse doesn’t enjoy the show much at all any more — and I’m perfectly happy with that. Steve’s a great guy, but he's satisfied by a straightforward \"let's talk about computers\" show in a way that I'm not. Similarly, I am glad that you’ve listened as much as you have, and especially that you’ve taken so much time to craft these comments filled to the brim with references and wisdom. You have a wealth of knowledge about the history of our field that I doubt I have any hope of matching. If the irreverence of our discussions makes you uncomfortable, all I can say is that I’m sorry — with sympathy, not apology. The concern you raised — “could cause your listeners to discount the importance of the papers or their authors” — I share that concern. But I feel quite differently about the mechanics of how and why Jimmy and I could bring positive attention to the history of our field. For my taste, I’d like to hear someone discuss something with a passion, or playfulness, that wanders all over every spectrum, standing on an audio stage with strange lighting and costuming, where the line between authenticity and affect is crooked and blurry, and you listen just as much for the thought-provoking ideas as for the wild way they're presented. I believe that’s the way to make the most engaging, inspiring reflection on the greatest works of our field.",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "gf94d2ed5e18",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/6f94d2ed5e188be9865a531021b0afcd.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0013-72.png",
            "first_name": "Ivan",
            "real_name": "Ivan Reese",
            "display_name": "Ivan Reese",
            "team": "T5TCAFTA9",
            "name": "ivanreese",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1680370755.360969",
        "parent_user_id": "UC2A2ARPT",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "a9ar",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "That was a genuine and helpful comment, loaded with so many references I don’t know where to begin. There’s a lot about respect now swirling around in this soup, so I want to start by saying I deeply respect the effort and care you put into writing these replies, and I hope that you find the below helpful, at least to bring a modicum of direct clarity that my last (audio) reply to you lacked.\n\nI hold a spider web of beliefs, feelings, and perspectives on what makes for a compelling podcast. For instance, the medium is particularly well suited to playing with immediacy and distance. I’ve listened to some podcasters hours each week for well over a decade now. After listening to someone so much for so long, you begin to feel a kinship with them. You may hear their voice, thoughts, and opinions more than those of your friends and even some of your family. Most people listen with headphones, often while driving or running or doing chores or laying in bed — spaces of domestic intimacy. These people — these podcasters — are invited into your home and your life in a way that’s arguably more personal than the painting that hangs on your wall, the movie or game that plays on your TV, the book that sits on your bookshelf. When John Siracusa dies, I’ll mourn him the way I’ve mourned my friends who have passed. I’ll feel an emptiness in my daily life, at least for a while. To me, that’s profound.\n\nI say all this to establish that immediacy is an effectful trait of the medium. It’s worth similarly exploring how podcasts push at the other extreme, being strangely distant and impersonal (for instance, considering what John Siracusa feels about me — unknowing nothingness, or vague appreciation as one appreciates a drop in an ocean). It’s worth exploring so many other dimensions and aspects. But for now I just want to make a point about my relationship to immediacy as a person who operates in this medium: on principle, I try very, very hard not to directly explain how or why I make certain creative decisions, unless doing so furthers my artistic goals. I don’t intend to be obscure about everything, but when it comes to particular things — like what my creative intentions are — I prefer to keep them behind the curtain.\n\nNow, you’ve written a few beautiful comments that have meant a lot to me. You are bothered by this matter of disrespecting the greats of our field, and you’ve articulated this bother quite compellingly: “could cause your listeners to discount the importance of the papers or their authors”. This speaks to me. So I’m going to justify as best I can, with no playful ruse or manipulation of distance or surrealist feint, why I think that it’s a fine thing that I, ahem, talk shit about the great masters.\n\nTo start, know that I’m always just trying to make the sort of podcast I’d want to listen to, and that I'm just beginning to learn what is even possible within the medium, and that I'm failing as much as I succeed. I’m borrowing from all my influences, and mixing in ideas from other media, and trying to shape the result into something that reflects my tastes and embodies the ideas I want to express to the world. I love how Radiolab fuses sound design, music, and conversation into a sort of audio theatre. I love how Merlin Mann, across his thousand shows, creates this swirling mass of in-jokes and references and allusions and hallucinations that point back to his earlier in-jokes and references and allusions and hallucinations, a chaotic “I can’t explain why this is making me laugh and weep because it came from 15 years of living with this wacky character, but I’m overpowered and it feels transcendental”. I love how scores, arguably starting with Ligeti and all but inescapably today, are distilled noise music for the masses. I feel an almost parental love when I see someone struggling to do something, and they aren’t quite succeeding, and the thing they’re making is frankly bad, but you can tell what they’re going for and, with the benefit of the doubt, you can appreciate it just as much as if they had pulled it off. I love listening to friends debate, where the arguments swing between the matter at hand and personal jabs, taken with a smile and returned in kind because these are people who love and trust each other so deeply that they know how to tickle with their words. I love how the hosts of Connected create a segment, and then someone messes up and perverts the segment, and before long you have people lying down to read the rules of the inner game show within the segment where you stand up to read the rules of the outer game show, it’s convoluted meta-text all the way down, but somebody MUST be the loser, and they go last.\n\nI’m trying to bring a little bit of all of this, and put it into a podcast where we talk about computers. I’m not going to be content to merely have a podcast where we talk about computers. The subject is computers, but the form needs to be something very purposefully more than just “we talk about computers”.\n\nThere are so, so many podcasts about computers. On those podcasts, you can hear breathless hyperbole about the latest startup or framework. You can hear interview after interview following an identical formula — leading 15 second excerpt, electronic theme song with canned intro, quick banter between hosts, introduction of guest, guest’s background, warmup questions, questions about main topic, zoom-out question that’s usually the highlight of the show, hosts talking about things they like, pleading for Patreons, sign-off with social handles. You can hear someone reading a script they wrote after wiki-diving on some comp-sci esoterica. You can hear (usually) three (usually) white (usually) men talk about the latest Apple rumours. You get the picture. In each of these, people are speaking sincerely and directly. They're being their authentic selves. There's no line drawn between who they are on the show, and who they are in real life. They’re making audio diaries, or patterning themselves after journalists, presenting subject matter with little regard to the artistic form and medium that they’re operating within. They’re careful to be respectful of the material, because they're real people who are just as kind and enthusiastic in real life as they are on their show.\n\nI’m trying to make a show where the format is that there is no format (credit where due: this is a Merlin Mann-ism); where there’s a fruit salad of heated debate between people who aren’t even sure they’re debating the same thing, emphatic teary-eyed gushing of joy at the profundity of some shared revelation, and among many other similar things, merciless cheap-shot dunking on, yes, the revered grand pantheon works of great masters, because all of these things are a kind of iterated "
                            },
                            {
                                "type": "text",
                                "text": "character development",
                                "style": {
                                    "italic": true
                                }
                            },
                            {
                                "type": "text",
                                "text": " that you don’t see in any of the shows described by the previous paragraph; meta-commentary and audio theatre and honest-to-goodness "
                            },
                            {
                                "type": "text",
                                "text": "songs",
                                "style": {
                                    "italic": true
                                }
                            },
                            {
                                "type": "text",
                                "text": " and stingers and sonic bits that give each and every episode a distinct flavour; where you can’t tell if we’re being real or fake, awake or dreaming, scripted or improvising or being our authentic selves, smart or inane, funny or fearsome. I don't want the show to be a straightforward discussion, nor do I want it to be a scripted narrative. I want it to be a space where interesting ideas are shared in interesting ways.\n\n[Note to returning readers: the following paragraph was rewritten to better support the point I'm driving at.]\n\nSo to look back at your initial message:\n"
                            }
                        ]
                    },
                    {
                        "type": "rich_text_quote",
                        "elements": [
                            {
                                "type": "text",
                                "text": "In general, it is more helpful to ask \"what was it about this person's experience and environment that led them to view things this way? Are those things relevant to me and to now? If so, how? If not, what is different?\" than to say \"F--- this paragraph\" or \"He's wrong here.\""
                            }
                        ]
                    },
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "If my intention for the show was to be my pure authentic self, sharing my immediate perspectives on programming papers, your feedback here would be spot on, and I'd have no hesitation to agree. But my reply — inviting you to ask a similar sort of \"Why are they doing what they're doing?\" — was meant to suggest that I have other intentions for the show that sit at odds with your ask. One of which is that the Ivan who appears on the podcast is a "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/www.youtube.com\/watch?v=YQQwrlGCID8",
                                "text": "character",
                                "style": {
                                    "italic": true
                                }
                            },
                            {
                                "type": "text",
                                "text": ". This character is "
                            },
                            {
                                "type": "text",
                                "text": "played up",
                                "style": {
                                    "italic": true
                                }
                            },
                            {
                                "type": "text",
                                "text": " for effect, because, again, that's the sort of podcast I like to listen to. Yes, I like listening to shows where people are occasionally crass and disrespectful — especially when they’re doing it in honor or service of something higher than themselves, or winkingly, or as an interplay between high-brow and low-brow, or in an “afflict the comfortable \/ comfort the afflicted” punching-up sort of way, or simply because it creates more hilarity and drama. For this show, I want my character to wander around the entire space of positive and negative feelings engendered by every subject we touch upon. To me, that’s the most interesting and rewarding show I can create. It's what pushes the show away from being mere pabulum, and entices people to engage with the subject matter because they're bewitched and enthralled by how we present it.\n\nSo to conclude, I’ll just borrow a tired but true adage when frustrated with art. I’m making this podcast, and while I value the audience we have (so, so much — but that’s a tangent), I’m always going to make the sort of show that I want to listen to, and I don’t for a single moment expect that anyone else will enjoy it, nor do I aim to make it to please them. I’m quite confident that, for instance, Steve Krouse doesn’t enjoy the show much at all any more — and I’m perfectly happy with that. Steve’s a great guy, but he's satisfied by a straightforward \"let's talk about computers\" show in a way that I'm not. Similarly, I am glad that you’ve listened as much as you have, and especially that you’ve taken so much time to craft these comments filled to the brim with references and wisdom. You have a wealth of knowledge about the history of our field that I doubt I have any hope of matching. If the irreverence of our discussions makes you uncomfortable, all I can say is that I’m sorry — with sympathy, not apology. The concern you raised — “could cause your listeners to discount the importance of the papers or their authors” — I share that concern. But I feel quite differently about the mechanics of how and why Jimmy and I could bring positive attention to the history of our field. For my taste, I’d like to hear someone discuss something with a passion, or playfulness, that wanders all over every spectrum, standing on an audio stage with strange lighting and costuming, where the line between authenticity and affect is crooked and blurry, and you listen just as much for the thought-provoking ideas as for the wild way they're presented. I believe that’s the way to make the most engaging, inspiring reflection on the greatest works of our field."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "cake",
                "users": [
                    "U03R0B9U1GD",
                    "UA14TGLTC",
                    "U03B14DUZSA",
                    "US370TRJA"
                ],
                "count": 4
            }
        ]
    },
    {
        "user": "U03CEGR3HSL",
        "type": "message",
        "ts": "1682829524.999199",
        "client_msg_id": "77420c46-86a0-4454-af7f-d6278d0d032a",
        "text": "<@UC2A2ARPT>  Thank you so much for your thoughtful and detailed reply. It will take me several readings and much reflection to fully absorb it and I appreciate all of the effort you put into it. \n\nI have tried to offer my feedback in as constructive a manner as I can, and it is clear that you have heard me, so I will try to stop criticizing your style though I may occasionally offer some friendly disagreement.\n\nFor what it's worth your show is one of very few to which I have ever given any feedback, and is the only one that I take notes on while listening. Hopefully that tells you how much I like and am engaged by the show and the topic overall.\n\nI look forward to the next episode, and if the comment about Intercal wasn't an April Fool's joke then I know I will enjoy it.\n\nThank you for your wonderful show!",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g7fd1bd5c536",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/7fd1bd5c53681452a80086a54ebb2ad1.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0024-72.png",
            "first_name": "Personal",
            "real_name": "Personal Dynamic Media",
            "display_name": "Personal Dynamic Media",
            "team": "T5TCAFTA9",
            "name": "personaldynamicmedia",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1680370755.360969",
        "parent_user_id": "UC2A2ARPT",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "vFIG",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "user",
                                "user_id": "UC2A2ARPT"
                            },
                            {
                                "type": "text",
                                "text": "  Thank you so much for your thoughtful and detailed reply. It will take me several readings and much reflection to fully absorb it and I appreciate all of the effort you put into it. \n\nI have tried to offer my feedback in as constructive a manner as I can, and it is clear that you have heard me, so I will try to stop criticizing your style though I may occasionally offer some friendly disagreement.\n\nFor what it's worth your show is one of very few to which I have ever given any feedback, and is the only one that I take notes on while listening. Hopefully that tells you how much I like and am engaged by the show and the topic overall.\n\nI look forward to the next episode, and if the comment about Intercal wasn't an April Fool's joke then I know I will enjoy it.\n\nThank you for your wonderful show!"
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "beers",
                "users": [
                    "UC2A2ARPT",
                    "U03R0B9U1GD",
                    "US370TRJA"
                ],
                "count": 3
            }
        ]
    }
]