[
    {
        "user": "U05GG4X497W",
        "type": "message",
        "ts": "1714619157.913519",
        "edited": {
            "user": "U05GG4X497W",
            "ts": "1714619290.000000"
        },
        "client_msg_id": "f03ce59c-3178-463c-998a-f253f81a2127",
        "text": "Hey there, I'm a startup founder in the drug discovery analytics space. I previously worked as a computational biologist doing cancer immunology research. Many difficulties in that experience led me to work on developing a conversational data analytics platform for biologists. I want to learn more about strategies to enable scientists without deep computational expertise be able to interact with big data more intuitively. That includes the design domain specific languages and efficient abstraction strategies of the analytical functionalities\/libraries in certain biological domains. I'm located in San Diego if any of you guys are from around here. I'm also <https:\/\/voyant.bio\/#roles|looking for a cofounder> if you know anybody with relevant engineering experience and interests.",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g509eabc1768",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/509eabc1768074d148e1ed43e0510cda.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0008-72.png",
            "first_name": "Assaf",
            "real_name": "Assaf",
            "display_name": "Assaf",
            "team": "T5TCAFTA9",
            "name": "slack1477",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "xuTZM",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Hey there, I'm a startup founder in the drug discovery analytics space. I previously worked as a computational biologist doing cancer immunology research. Many difficulties in that experience led me to work on developing a conversational data analytics platform for biologists. I want to learn more about strategies to enable scientists without deep computational expertise be able to interact with big data more intuitively. That includes the design domain specific languages and efficient abstraction strategies of the analytical functionalities\/libraries in certain biological domains. I'm located in San Diego if any of you guys are from around here. I'm also "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/voyant.bio\/#roles",
                                "text": "looking for a cofounder"
                            },
                            {
                                "type": "text",
                                "text": " if you know anybody with relevant engineering experience and interests."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "wave",
                "users": [
                    "UA14TGLTC",
                    "U013ZLJARC7",
                    "U0584S0ULF8",
                    "UJBAJNFLK",
                    "UC2A2ARPT",
                    "U0123H7JRDM",
                    "U06AEM4TRT2",
                    "U06SS0DHZD1",
                    "U0669J3HJJJ",
                    "U05BXJTH8EN"
                ],
                "count": 10
            }
        ]
    }
]