[
    {
        "user": "U02E4DAQGSZ",
        "type": "message",
        "ts": "1720604993.704619",
        "edited": {
            "user": "U02E4DAQGSZ",
            "ts": "1720605077.000000"
        },
        "client_msg_id": "45efdb6d-750c-4f70-8249-aa9f2330798a",
        "text": "Dunno how welcome filthy capitalism is here but I kind of consider where I am working a FoC startup in some ways, and its in Berlin, and its hiring for a Front end\/ full stack mid-level. Its a ycombinator. Its a great opportunity, we don't hire much as everyone is happy. We have been doing very well and fast becoming the main international player in credit decisioning (admittedly slightly yawn industry). The <https:\/\/taktile.com\/|website> is (deliberately) bland but the actual product is an advanced amalgamation of data\/IDE\/Decision Engine so its a rare combo of market, people and product.\n\nIts a multiplayer low code environment that speaks python, so there are code escape hatches in everywhere, and the main canvas is node and wire. We build and  host the decision engine. Its over fitted to finance, so it connects to Experian\/Schufa and suchlike out of the box... and it is DATA aware, so imagine combining IDE with data warehouse. Absolutely great uptake in the industry, I started before the product launch and the growth trajectory is pretty much ideal for a B2B product, its got fit for sure, now we consider building sideways as the core product is kind of generic. DM me if you are interested. If you are senior we will consider too, but we are a bit over stacked in seniors really so ideally we get someone who is demonstrably great but inexperienced and who is hungry to level up.",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "27dffd0e73bd",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-09-13\/2483463922595_27dffd0e73bd6f709927_72.gif",
            "first_name": "Tom",
            "real_name": "Tom Larkworthy",
            "display_name": "Tom Larkworthy",
            "team": "T5TCAFTA9",
            "name": "tom.larkworthy",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "hnBJ5",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Dunno how welcome filthy capitalism is here but I kind of consider where I am working a FoC startup in some ways, and its in Berlin, and its hiring for a Front end\/ full stack mid-level. Its a ycombinator. Its a great opportunity, we don't hire much as everyone is happy. We have been doing very well and fast becoming the main international player in credit decisioning (admittedly slightly yawn industry). The "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/taktile.com\/",
                                "text": "website"
                            },
                            {
                                "type": "text",
                                "text": " is (deliberately) bland but the actual product is an advanced amalgamation of data\/IDE\/Decision Engine so its a rare combo of market, people and product.\n\nIts a multiplayer low code environment that speaks python, so there are code escape hatches in everywhere, and the main canvas is node and wire. We build and  host the decision engine. Its over fitted to finance, so it connects to Experian\/Schufa and suchlike out of the box... and it is DATA aware, so imagine combining IDE with data warehouse. Absolutely great uptake in the industry, I started before the product launch and the growth trajectory is pretty much ideal for a B2B product, its got fit for sure, now we consider building sideways as the core product is kind of generic. DM me if you are interested. If you are senior we will consider too, but we are a bit over stacked in seniors really so ideally we get someone who is demonstrably great but inexperienced and who is hungry to level up."
                            }
                        ]
                    }
                ]
            }
        ]
    }
]