[
    {
        "user": "U5STGTB3J",
        "type": "message",
        "ts": "1702894289.464369",
        "client_msg_id": "3CA1449B-03A8-4AE1-A661-DFAC2E57931B",
        "text": "What if it’s the other way around?\n\nWe are so used to using language — and especially so if we are trained in programming — thinking with a “voice” in our heads that we can’t imagine what it was like before we learned our first language. But we _learned_ it. We were not born with it. \n\nThe meaning primitives we started with that enabled us to make enough sense of the world around us to learn a language must therefore be based on something else. Ergo “meaning”, in the sense how a sentence makes sense to us, is itself just a metaphor for something ineffable that goes on under the hood in our subconscious mind long before concepts and words pop up in our consciousness.\n\nSo maybe it’s not that the connotations emerge from the words, but that the words always carry additional residue of those thinking primitives that never quite perfectly match the words and ultimately make human language so much more ambiguous than any language based on strict formalism.\n\nIn case you can’t tell, I’m a huge fan of cognitive linguistics which has lots more to say about all that (in contrast to generative linguistics, which is what you partially learn in computer science, with grammars, Chomsky et al.).",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "649181907e06",
            "image_72": "https:\/\/avatars.slack-edge.com\/2017-08-20\/228447816352_649181907e06ec450c64_72.jpg",
            "first_name": "Stefan",
            "real_name": "Stefan Lesser",
            "display_name": "Stefan",
            "team": "T5TCAFTA9",
            "name": "stefanlesser",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1702757349.726829",
        "parent_user_id": "UC2A2ARPT",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "Pk52H",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "What if it’s the other way around?\n\nWe are so used to using language — and especially so if we are trained in programming — "
                            },
                            {
                                "type": "text",
                                "text": "thinking with a “voice” in our heads"
                            },
                            {
                                "type": "text",
                                "text": " that we can’t imagine what it was like before we learned our first language. But we "
                            },
                            {
                                "type": "text",
                                "text": "learned",
                                "style": {
                                    "bold": false,
                                    "italic": true,
                                    "strike": false
                                }
                            },
                            {
                                "type": "text",
                                "text": " it. We were not born with it. \n\nThe meaning primitives we started with that enabled us to make enough sense of the world around us to learn a language must therefore be based on something else. Ergo “meaning”, in the sense how a sentence makes sense to us, is itself just a metaphor for something ineffable that goes on under the hood in our subconscious mind long before concepts and words pop up in our consciousness"
                            },
                            {
                                "type": "text",
                                "text": "."
                            },
                            {
                                "type": "text",
                                "text": "\n\n"
                            },
                            {
                                "type": "text",
                                "text": "So "
                            },
                            {
                                "type": "text",
                                "text": "maybe "
                            },
                            {
                                "type": "text",
                                "text": "it’s"
                            },
                            {
                                "type": "text",
                                "text": " not that the connotations emerge from the words, but that the words always carry additional residue of those thinking primitives that never quite perfectly match the words and ultimately make human language so much more ambiguous than any language based on strict formalism.\n\nIn case you "
                            },
                            {
                                "type": "text",
                                "text": "c"
                            },
                            {
                                "type": "text",
                                "text": "an’t tell, I’m a huge fan of cognitive linguistics which has lots more to say about all that (in contrast to generative linguistics, which is what you partially learn in computer science, with grammars, Chomsky et al.)."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U023V63MF6V"
                ],
                "count": 1
            }
        ]
    }
]