[
    {
        "user": "U05GG4X497W",
        "type": "message",
        "ts": "1714690492.856799",
        "client_msg_id": "699796b0-ddfb-4793-a5a5-62fbe953b703",
        "text": "I'm exploring strategies to enable scientists (biologists in pharma) without computational expertise be able to interact with big data more intuitively. My ultimate goal is to have users ask biological questions, and the system to generate and execute analytical workflows utilizing existing methods from the scientific domain to answer these questions with data visualizations,\nI evaluated the non-interpretable and inaccurate \"chat your data\" LLM solutions. I'm currently thinking about the possibilities of developing\/using a DSL as intermediary output prior to code generation to make the process more interpretable. I am also considering what would be the most efficient abstraction strategies of the analytical functionalities\/libraries in certain biological domains to improve the accuracy of the outputs (of the higher level strategy and the actual code). I would love to brainstorm about these problems offline\/online. Here's my <https:\/\/futureofcoding.slack.com\/archives\/CC2JRGVLK\/p1714619157913519|intro post> for a bit more context about me.",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g509eabc1768",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/509eabc1768074d148e1ed43e0510cda.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0008-72.png",
            "first_name": "Assaf",
            "real_name": "Assaf",
            "display_name": "Assaf",
            "team": "T5TCAFTA9",
            "name": "slack1477",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "2\/M74",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "I'm exploring strategies to enable scientists (biologists in pharma) without computational expertise be able to interact with big data more intuitively. My ultimate goal is to have users ask biological questions, and the system to generate and execute analytical workflows utilizing existing methods from the scientific domain to answer these questions with data visualizations,\nI evaluated the non-interpretable and inaccurate \"chat your data\" LLM solutions. I'm currently thinking about the possibilities of developing\/using a DSL as intermediary output prior to code generation to make the process more interpretable. I am also considering what would be the most efficient abstraction strategies of the analytical functionalities\/libraries in certain biological domains to improve the accuracy of the outputs (of the higher level strategy and the actual code). I would love to brainstorm about these problems offline\/online. Here's my "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/futureofcoding.slack.com\/archives\/CC2JRGVLK\/p1714619157913519",
                                "text": "intro post"
                            },
                            {
                                "type": "text",
                                "text": " for a bit more context about me."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "fire",
                "users": [
                    "UNCP67JSK"
                ],
                "count": 1
            }
        ]
    }
]