[
    {
        "user": "UEGFXUK3M",
        "type": "message",
        "ts": "1578058528.001400",
        "client_msg_id": "3c24ec2c-bd68-4c89-b4f7-b593179a4804",
        "text": "Holy macabre <https:\/\/dominiccummings.com\/2020\/01\/02\/two-hands-are-a-lot-were-hiring-data-scientists-project-managers-policy-experts-assorted-weirdos\/>",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "bbd74d10a2d2",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-04-24\/1108683470016_bbd74d10a2d2a0dbb156_72.jpg",
            "first_name": "Jack",
            "real_name": "Jack",
            "display_name": "jarm",
            "team": "T5TCAFTA9",
            "name": "jack",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "attachments": [
            {
                "service_name": "Dominic Cummings's Blog",
                "service_url": "http:\/\/dominiccummings.com",
                "title": "‘Two hands are a lot’ — we’re hiring data scientists, project managers, policy experts, assorted weirdos…",
                "title_link": "https:\/\/dominiccummings.com\/2020\/01\/02\/two-hands-are-a-lot-were-hiring-data-scientists-project-managers-policy-experts-assorted-weirdos\/",
                "author_name": "dominiccummings",
                "author_link": "https:\/\/dominiccummings.com\/author\/dominiccummings\/",
                "text": "&lsquo;This is possibly the single largest design flaw contributing to the bad Nash equilibrium in which &hellip; many governments are stuck. Every individual high-functioning competent person knows they can&rsquo;t make much difference by being one more face in that crowd.&rsquo; Eliezer Yudkowsky, AI expert, LessWrong etc.\n&lsquo;[M]uch of our intellectual elite who think they have &ldquo;the solutions&rdquo; have actually cut themselves off from understanding the basis for much of the most important human progress.&rsquo; Michael Nielsen, physicist and one of the handful of most interesting people I&rsquo;ve ever talked to.\n&lsquo;People, ideas, machines &mdash; in that order.&rsquo; Colonel Boyd.\n&lsquo;There isn&rsquo;t one novel thought in all of how Berkshire [Hathaway] is run. It&rsquo;s all about &hellip; exploiting unrecognized simplicities.&rsquo; Charlie Munger,Warren Buffett&rsquo;s partner.\n&lsquo;Two hands, it isn&rsquo;t much considering how the world is infinite. Yet, all the same, two hands, they are a lot.&rsquo; Alexander Grothendieck, one of the great mathematicians.\n*\nThere are many brilliant people in the civil service and politics. Over the past five months the No10 political team has been lucky to work with some fantastic officials. But there are also some profound problems at the core of how the British state makes decisions. This was seen by pundit-world as a very eccentric view in 2014. It is no longer seen as eccentric. Dealing with these deep problems is supported by many great officials, particularly younger ones, though of course there will naturally be many fears &mdash; some reasonable, most unreasonable.\nNow there is a confluence of: a) Brexit requires many large changes in policy and in the structure of decision-making, b) some people in government are prepared to take risks to change things a lot, and c) a new government with a significant majority and little need to worry about short-term unpopularity while trying to make rapid progress with long-term problems.\nThere is a huge amount of low hanging fruit &mdash; trillion dollar bills lying on the street &mdash; in the intersection of:\nthe selection, education and training of people for&nbsp;high performance\nthe frontiers of the science of prediction\ndata science, AI and cognitive technologies (e.g Seeing Rooms,&nbsp;&lsquo;authoring tools designed for arguing from evidence&rsquo;, Tetlock\/IARPA prediction tournaments that could easily be extended to consider &lsquo;clusters&rsquo; of issues around themes like Brexit to improve policy and project management)\ncommunication&nbsp;(e.g Cialdini)\ndecision-making institutions at the apex of government.\nWe want to hire an unusual set of people with different skills and backgrounds to work in Downing Street with the best officials, some as spads and perhaps some as officials. If you are already an official and you read this blog and think you fit one of these categories, get in touch.\nThe categories are roughly:\nData scientists and software developers\nEconomists\nPolicy experts\nProject managers\nCommunication experts\nJunior researchers one of whom will also be my personal assistant\nWeirdos and misfits with odd skills\nWe want to improve performance and make me much less important &mdash; and within a year largely redundant. At the moment I have to make decisions well outside what Charlie Munger calls my &lsquo;circle of competence&rsquo; and we do not have the sort of expertise supporting the PM and ministers that is needed. This must change fast so we can properly serve the public.\nA. Unusual mathematicians, physicists, computer scientists, data scientists\nYou must have exceptional academic qualifications from one of the world&rsquo;s best universities or have done something that demonstrates equivalent (or greater) talents and skills. You do not need a PhD &mdash; as Alan Kay said, we are also interested in graduate students as &lsquo;world-class researchers who don&rsquo;t have PhDs yet&rsquo;.\nYou should have the following:\nPhD or MSc in maths or physics.\nOutstanding mathematical skills are essential.\nExperience of using analytical languages: e.g. Python, SQL, R.\nFamiliarity with data tools and technologies such as Postgres, Scikit Learn, NEO4J.\nA few examples of papers that you will be considering:\nThis Nature paper, Early warning signals for critical transitions in a thermoacoustic system, looking at early warning systems in physics that could be applied to other areas from finance to epidemics.\nStatistical &amp; ML forecasting methods: Concerns and ways forward, Spyros Makridakis, 2018. This compares statistical and ML methods in a forecasting tournament (won by a hybrid stats\/ML approach).\nComplex Contagions : A Decade in Review, 2017. This looks at a large number of studies on &lsquo;what goes viral and why?&rsquo;. A lot of studies in this field are dodgy (bad maths, don&rsquo;t replicate etc), an important question is which ones are worth examining.\nModel-Free Prediction of Large Spatiotemporally Chaotic Systems from Data: A Reservoir Computing Approach, 2018. This applies ML to predict chaotic systems.\nScale-free networks are rare, Nature 2019. This looks at the question of how widespread scale-free networks really are and how useful this approach is for making predictions in diverse fields.&nbsp;\nOn the frequency and severity of interstate wars, 2019. &lsquo;How can it be possible that the frequency and severity of interstate wars are so consistent with a stationary model, despite the enormous changes and obviously non-stationary dynamics in human population, in the number of recognized states, in commerce, communication, public health, and technology, and even in the modes of war itself? The fact that the absolute number and sizes of wars are plausibly stable in the face of these changes is a profound mystery for which we have no explanation.&rsquo; Does this claim stack up?\nThe papers on computational rationality below.\nThe work of Judea Pearl, the leading scholar of causation who has transformed the field.&nbsp;\nYou should be able to explain to other mathematicians, physicists and computer scientists the ideas in such papers, discuss what could be useful for our projects, synthesise ideas for other data scientists, and apply them to practical problems. You won&rsquo;t be expert on the maths used in all these papers but you should be confident that you could study it and understand it.\nWe will be using machine learning and associated tools so it is important you can program. You do not need software development levels of programming but it would be an advantage.\nThose applying must watch Bret Victor&rsquo;s talks and study Dynamic Land.&nbsp;If this excites you, then apply; if not, then don&rsquo;t. I and others interviewing will discuss this with anybody who comes for an interview.&nbsp;If you want a sense of the sort of things you&rsquo;d be working on, then read my previous blog on Seeing Rooms, cognitive technologies etc.\nB. Unusual software developers\nWe are looking for great software developers who would love to work on these ideas, build tools and work with some great people. You should also look at some of Victor&rsquo;s technical talks on programming languages and the history of computing.\nYou will be working with data scientists, designers and others.\nC. Unusual economists\nWe are looking to hire some recent graduates in economics. You should a) have an outstanding record at a great university, b) understand conventional economic theories, c) be interested in arguments on the edge of the field &mdash; for example, work by physicists on &lsquo;agent-based models&rsquo; or by the hedge fund Bridgewater on the failures\/limitations of conventional macro theories\/prediction, and d) have very strong maths and be interested in working with mathematicians, physicists, and computer scientists.\nThe ideal candidate might, for example, have a degree in maths and economics, worked at the LHC in one summer, worke…",
                "fallback": "Dominic Cummings's Blog Link: &#8216;Two hands are a lot&#8217; &#8212; we&#8217;re hiring data scientists, project managers, policy experts, assorted&nbsp;weirdos&#8230;",
                "from_url": "https:\/\/dominiccummings.com\/2020\/01\/02\/two-hands-are-a-lot-were-hiring-data-scientists-project-managers-policy-experts-assorted-weirdos\/",
                "service_icon": "https:\/\/s2.wp.com\/i\/webclip.png",
                "id": 1,
                "original_url": "https:\/\/dominiccummings.com\/2020\/01\/02\/two-hands-are-a-lot-were-hiring-data-scientists-project-managers-policy-experts-assorted-weirdos\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "pHdoF",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "Holy macabre "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/dominiccummings.com\/2020\/01\/02\/two-hands-are-a-lot-were-hiring-data-scientists-project-managers-policy-experts-assorted-weirdos\/"
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UK22Z72L8",
                    "UNCP67JSK"
                ],
                "count": 2
            }
        ]
    },
    {
        "user": "UEGFXUK3M",
        "type": "message",
        "ts": "1578058544.001800",
        "client_msg_id": "f0f23e3b-c9e1-49ba-ab0b-ab8d53ad4b44",
        "text": "A decent-ish response: <http:\/\/www.oneill.io\/2020\/01\/03\/slight-return\/>",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "bbd74d10a2d2",
            "image_72": "https:\/\/avatars.slack-edge.com\/2020-04-24\/1108683470016_bbd74d10a2d2a0dbb156_72.jpg",
            "first_name": "Jack",
            "real_name": "Jack",
            "display_name": "jarm",
            "team": "T5TCAFTA9",
            "name": "jack",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1578058544.001800",
        "reply_count": 16,
        "reply_users_count": 2,
        "latest_reply": "1578325965.010100",
        "reply_users": [
            "UK22Z72L8",
            "UEGFXUK3M"
        ],
        "replies": [
            {
                "user": "UK22Z72L8",
                "ts": "1578315251.002000"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578315715.006800"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317139.007100"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317208.007300"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317265.007500"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578317295.007700"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317356.007900"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317394.008100"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578317471.008300"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317485.008500"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317520.008800"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578317640.009300"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578317709.009500"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578317978.009700"
            },
            {
                "user": "UEGFXUK3M",
                "ts": "1578318178.009900"
            },
            {
                "user": "UK22Z72L8",
                "ts": "1578325965.010100"
            }
        ],
        "is_locked": false,
        "subscribed": false,
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "PWqRh",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "A decent-ish response: "
                            },
                            {
                                "type": "link",
                                "url": "http:\/\/www.oneill.io\/2020\/01\/03\/slight-return\/"
                            }
                        ]
                    }
                ]
            }
        ]
    }
]