[
    {
        "user": "UJBAJNFLK",
        "type": "message",
        "ts": "1557929091.016100",
        "client_msg_id": "d1ade607-751c-431f-a0a4-0fb84bc3551b",
        "text": "There are many reasons to dislike Slack for our discussions. Let me add one: we need not only streams, but also a garden (see <https:\/\/hapgood.us\/2015\/10\/17\/the-garden-and-the-stream-a-technopastoral\/> for a nice explanation). As a newcomer, I am well placed to see that finding ressources mentioned earlier in the Slack history is such a pain that it's almost not worth it.",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "e169f54bbaf8",
            "image_72": "https:\/\/avatars.slack-edge.com\/2021-03-12\/1859691333940_e169f54bbaf8b9b36b12_72.png",
            "first_name": "Konrad",
            "real_name": "Konrad Hinsen",
            "display_name": "Konrad Hinsen",
            "team": "T5TCAFTA9",
            "name": "konrad.hinsen",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1557929091.016100",
        "reply_count": 5,
        "reply_users_count": 3,
        "latest_reply": "1558042362.017900",
        "reply_users": [
            "UGLSY9X3J",
            "U5TCAFTD3",
            "UHWC9PXBL"
        ],
        "replies": [
            {
                "user": "UGLSY9X3J",
                "ts": "1557947817.016500"
            },
            {
                "user": "U5TCAFTD3",
                "ts": "1558016656.017000"
            },
            {
                "user": "UHWC9PXBL",
                "ts": "1558042303.017400"
            },
            {
                "user": "UHWC9PXBL",
                "ts": "1558042335.017600"
            },
            {
                "user": "UHWC9PXBL",
                "ts": "1558042362.017900"
            }
        ],
        "is_locked": false,
        "subscribed": true,
        "last_read": "1558188039.000397",
        "attachments": [
            {
                "service_name": "Hapgood",
                "service_url": "http:\/\/hapgood.us",
                "title": "The Garden and the Stream: A Technopastoral",
                "title_link": "https:\/\/hapgood.us\/2015\/10\/17\/the-garden-and-the-stream-a-technopastoral\/",
                "author_name": "mikecaulfield",
                "author_link": "https:\/\/hapgood.us\/author\/mikecaulfield\/",
                "thumb_url": "https:\/\/mikecaulfield.files.wordpress.com\/2015\/10\/t_d4424f37-afe9-7065-bc7f-13540c92ce85.jpg?fit=200%2C150",
                "thumb_width": 200,
                "thumb_height": 124,
                "text": "Opening keynote for dLRN 2015. Delivered October 16th @ Stanford. Actual keynote may have gone on significant tangents&hellip;\n1 | a year in the garden\nA week or so ago, I was reading about the Oregon shooting. I&rsquo;m a pretty standard issue liberal and when I see things that support my liberal views I tend to notice them.\n\nSo when I see this line in an article I get all excited. This is from the CSJ:\n\nThe prevalence of gun ownership in a given state is &ldquo;significantly associated with state incidence of mass killings with firearms, school shootings, and mass shootings,&rdquo; according to a study published last July from numbers compiled of mass killings in the US between 2006 to December 2013.\n\nSo the blood starts pumping. Dammit, I&rsquo;m right. When will the world see it?\n&nbsp; via xkcd\nSo a year ago I would have thrown the link to Twitter with a damning summary of the study, and everyone would have known I was a good liberal and retweeted it to prove that they were good liberals and if you listened closely you could hear our collective neurons harden.\nBut for the past year I&rsquo;ve been experimenting with another form of social media called federated wiki. And it&rsquo;s radically changed how I think about online communication and collaboration.\nI don&rsquo;t want people to get hung up on the technology angle. I think sometimes people hear &ldquo;Federated Thingamabob&rdquo; and just sort of tune out thinking &ldquo;Oh, he&rsquo;s talking about a feature of Federated Thingamabob.&rdquo; But I&rsquo;m not. I&rsquo;m really not. I&rsquo;m talking about a different way to think your online activity, no matter what tool you use. And relevant to this conference, I&rsquo;m talking about a different way of collaborating as well.\nWithout going to much into what my federated wiki journal is, just imagine that instead of blogging and tweeting your experience you wiki&rsquo;d it. And over time the wiki became a representation of things you knew, connected to other people&rsquo;s wikis about things they knew.\nSo when I see an article like this I think &mdash; Wow, I don&rsquo;t have much in my wiki about gun control, this seems like a good start to build it out and I make a page.\nThe first thing I do is &ldquo;de-stream&rdquo; the article. The article is about Oregon, but I want to extract a reusable piece out of it in a way that it can be connected to many different things eventually. I want to make a home page for this idea or fact. My hub for thinking about this. So I make a page like so:\n\nThis is the most basic page I can imagine &mdash; it&rsquo;s pretty close to a tweet, and it took about as much time. I looked through the revision history and it took me about 45 seconds to make this much of the page, about the time it takes to tweet something. I started at 6:57 a. m. and had this up by 6:58.\nI wander away from it for a bit. I go and get my coffee and make sure the kids are getting ready for school. When I come back I see this page and I think, you know what would make this page better? A link to the actual study. So &nbsp;I spend a couple more minutes and track down the actual paper and add it.\n\nI add it, because this is the home page for this idea of mine on the web, and the home page for the idea should have a link to the study.\nHere we note we have a link to the study and indicate the link is only available via subscription.\nSo far this is not terribly different than tweeting. But now I look for things to link it to. I search my wiki for articles on suicide I could link this to.\n\nAnd I get really excited, because I remember the Suicide Belt article I wrote six months ago, and realize that would be a perfect&nbsp;link. So I link to it and read it again. And what I&rsquo;m trying to do now is think about what sentence I put in front of the link. I&rsquo;m thinking about how I define the relation.\nHowever, reading it I realize it&rsquo;s not the clean sort of support I was thinking about.\n\nWhy? Because when I link to it it reminds me that many sociologists believe the suicide belt is a result of the white, middle-aged demographics of the American West. Suicide rates of whites are more than twice those of blacks and the recent rise in suicide rates is a purely a white phenomenon.\nThis punctures my simple story where more guns = more suicides because the truth is that western states full of white males are going to tend to have both more gun ownership and more suicide.\nSo I write up my link:\n\nI say that there&rsquo;s a regional issue, but a potential lurking variable is male whiteness of population.\nNote how different this sort of meaning making is from what we generally see on today&rsquo;s web. The excitement here is in building complexity, not reducing it. More importantly note how meaning changes here. We probably know what the tweet would have &ldquo;meant&rdquo;, and what a blog post would have &ldquo;meant&rdquo;, but meaning here is something different. Instead of building an argument about the issue this attempts to build a model of the issue that can generate new understandings.\nI&rsquo;ve been working with Ward Cunningham, the guy who invented the original wiki back in 1995, on the educational use of this new personal wiki technology for a year and a half now, and I&rsquo;ve been keeping this personal wiki, which is a collection of both my own stuff and stuff I&rsquo;ve copied from other websites for over a year now.\nI have close to 1,000 articles in my personal wiki at this point. I have maybe 1,000 more scattered on other sites. They are from myself and others, most simple summaries of ideas I encounter, or data, or examples of ideas. Some are the result of afternoon-long rainy Saturday coffee shop investigations, but most are like what I have just showed you here, simple knowledge that builds complexity through linking.\nAnd when you get to that point, where you&rsquo;ve mapped out 1000s of articles of your own knowledge you start to see impacts on your thought that are very hard to describe.\nOver time these things you write up start to form a deep network that helps you think. Here&rsquo;s a representation of links to and from a page called &ldquo;On Its Side&rdquo; in my own wiki that details how Kandinsky invented his version of abstract art after seeing a representational painting of his on its side and not recognizing it as representational (and finding it vastly improved).\n\nYou can see this is tied via associative links to and from it to computer generated poetry of the 1980s, a &ldquo;found haiku&rdquo; called Haiku by a Robot (&ldquo;710,711,712&rdquo;), an incident on the Twin Peaks set that led to the creation of the Killer Bob character, and Stravinsky&rsquo;s attraction to the player piano. Other trails branch off into the relation between early abstract art and the Theosophical Movement. Together these things have meaning far more subtle and rich than one could get from a post or paper, a knowledge keeps its fluidity and continues to generate new insights.\nAnd weirdly, these links were compiled over the space of a year, just by noting things I learned or heard and linking them to things I&rsquo;d heard before or that others had written. I created a wiki on issues of found art without even knowing it.\nThis experience has radically changed me, to the point I find it hard to communicate with a lot of technologists anymore. It&rsquo;s like trying to explain literature to someone who has never read a book. You&rsquo;re asked &ldquo;So basically a book is just words someone said written down?&rdquo; And you say no, it&rsquo;s more than that. But how&nbsp;is it more than that?\nThis is my attempt to abstract from this experience something more general about the way in which we collaborate on the web, and the way in which it is currently very badly out of balance..\nI am going to make the argument that the predominant form of the social web &mdash; that amalgam of blogging, Twitter, Facebook, forums, Reddit, Instagram &mdas…",
                "fallback": "Hapgood Link: The Garden and the Stream: A&nbsp;Technopastoral",
                "from_url": "https:\/\/hapgood.us\/2015\/10\/17\/the-garden-and-the-stream-a-technopastoral\/",
                "service_icon": "https:\/\/s2.wp.com\/i\/webclip.png",
                "id": 1,
                "original_url": "https:\/\/hapgood.us\/2015\/10\/17\/the-garden-and-the-stream-a-technopastoral\/"
            }
        ],
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "LBJp",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "There are many reasons to dislike Slack for our discussions. Let me add one: we need not only streams, but also a garden (see "
                            },
                            {
                                "type": "link",
                                "url": "https:\/\/hapgood.us\/2015\/10\/17\/the-garden-and-the-stream-a-technopastoral\/"
                            },
                            {
                                "type": "text",
                                "text": " for a nice explanation). As a newcomer, I am well placed to see that finding ressources mentioned earlier in the Slack history is such a pain that it's almost not worth it."
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "UAL7940NM",
                    "UBSMEUXAA",
                    "UCGAK10LS",
                    "UA14TGLTC",
                    "UAVCC2X70",
                    "UBUFWBGNN"
                ],
                "count": 6
            }
        ]
    },
    {
        "user": "UGLSY9X3J",
        "type": "message",
        "ts": "1557947817.016500",
        "client_msg_id": "01e0656b-e767-4c31-a50a-e69f58119be6",
        "text": "interfaces for online discussion seems like an interesting research topic :slightly_smiling_face:",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "g03ebdf13bbe",
            "image_72": "https:\/\/secure.gravatar.com\/avatar\/e03ebdf13bbeacace66454bea388b927.jpg?s=72&d=https%3A%2F%2Fa.slack-edge.com%2Fdf10d%2Fimg%2Favatars%2Fava_0025-72.png",
            "first_name": "",
            "real_name": "Srini Kadamati",
            "display_name": "srini",
            "team": "T5TCAFTA9",
            "name": "srini",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1557929091.016100",
        "parent_user_id": "UJBAJNFLK",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "\/Gctw",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "interfaces for online discussion seems like an interesting research topic "
                            },
                            {
                                "type": "emoji",
                                "name": "slightly_smiling_face",
                                "unicode": "1f642"
                            }
                        ]
                    }
                ]
            }
        ],
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U5TCAFTD3"
                ],
                "count": 1
            },
            {
                "name": "+1",
                "users": [
                    "UJBAJNFLK"
                ],
                "count": 1
            }
        ]
    }
]