[
    {
        "user": "U06H4766K42",
        "type": "message",
        "ts": "1722720381.753739",
        "client_msg_id": "0204DD06-8CB9-4AD5-924F-F02557DFB69A",
        "text": "(Science Fiction prototyping \/ very biased wishlist) I’d love a system that replays conversations within topically based threads that dynamically accepts audio feedback like what Anchor for podcasts did back in the day and re-links or continues to add on the conversation with newer comments. The purpose of the audio potentially dictates the format. IE is this\nthread intended to teach\/summarize topics\/ideas, is this an exploratory thread, is this an action oriented thread with todo’s expected to come out of it, is it a thread of comments meant to encapsulate a specific idea from every angle? Sorry for the broken thought stream my attention is always under constant assault from outside. ",
        "team": "T5TCAFTA9",
        "user_team": "T5TCAFTA9",
        "source_team": "T5TCAFTA9",
        "user_profile": {
            "avatar_hash": "ead28e1d251c",
            "image_72": "https:\/\/avatars.slack-edge.com\/2024-02-04\/6594898212609_ead28e1d251ce07fa4fa_72.jpg",
            "first_name": "Justin",
            "real_name": "Justin Janes",
            "display_name": "",
            "team": "T5TCAFTA9",
            "name": "justinjjanes",
            "is_restricted": false,
            "is_ultra_restricted": false
        },
        "thread_ts": "1722031490.277229",
        "parent_user_id": "UC2A2ARPT",
        "blocks": [
            {
                "type": "rich_text",
                "block_id": "+JQbW",
                "elements": [
                    {
                        "type": "rich_text_section",
                        "elements": [
                            {
                                "type": "text",
                                "text": "(Science Fiction prototyping \/ very biased wishlist) I’d love a system that replays conversations within topically based threads that dynamically accepts audio feedback like what Anchor for podcasts did back in the day and re-links or continues to add on the conversation with newer comments"
                            },
                            {
                                "type": "text",
                                "text": "."
                            },
                            {
                                "type": "text",
                                "text": " The purpose of the audio potentially dictates the format"
                            },
                            {
                                "type": "text",
                                "text": "."
                            },
                            {
                                "type": "text",
                                "text": " IE is this\nthread intended to teach\/summarize topics"
                            },
                            {
                                "type": "text",
                                "text": "\/"
                            },
                            {
                                "type": "text",
                                "text": "ideas, is this an exploratory thread, is this an action oriented thread with todo’s expected to come out of it, is it a thread of comments meant to encapsulate a specific idea from every angle? Sorry for the broken thought stream my attention is always under constant assault from outside"
                            },
                            {
                                "type": "text",
                                "text": "."
                            },
                            {
                                "type": "text",
                                "text": " "
                            }
                        ]
                    }
                ]
            }
        ]
    }
]